heatTransfer/chtMultiRegionFoam/externalSolarLoad/constant/solid/radiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      radiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

radiation       on;

radiationModel  opaqueSolid;

absorptionEmissionModel multiBandSolidAbsorptionEmission;

multiBandSolidAbsorptionEmissionCoeffs
{
    absorptivity    (0.7 0.7);
    emissivity      (0.7 0.7);
}

transmissivityModel     multiBandSolidTransmissivity;

multiBandSolidTransmissivityCoeffs
{
    transmissivity    (0 0);
}

scatterModel    none;

sootModel none;

// ************************************************************************* //
